lab11/nrf5x-base/sdk/nrf5_sdk_15.3.0_thread/external/nRF/mock_nrf_802154_priority_drop.h
/* AUTOGENERATED FILE. DO NOT EDIT. */
#ifndef _MOCK_NRF_802154_PRIORITY_DROP_H
#define _MOCK_NRF_802154_PRIORITY_DROP_H

#ifndef __STATIC_INLINE
#define __STATIC_INLINE
#else
#undef __STATIC_INLINE
#define __STATIC_INLINE
#endif
#define SUPPRESS_INLINE_IMPLEMENTATION

#include <nrf_802154_priority_drop.h>
#undef SUPPRESS_INLINE_IMPLEMENTATION
#undef __STATIC_INLINE
#define __STATIC_INLINE __STATIC_INLINE1

void mock_nrf_802154_priority_drop_Init(void);
void mock_nrf_802154_priority_drop_Destroy(void);
void mock_nrf_802154_priority_drop_Verify(void);




#define nrf_802154_priority_drop_init_Ignore() nrf_802154_priority_drop_init_CMockIgnore()
void nrf_802154_priority_drop_init_CMockIgnore(void);
#define nrf_802154_priority_drop_init_Expect() nrf_802154_priority_drop_init_CMockExpect(__LINE__)
void nrf_802154_priority_drop_init_CMockExpect(UNITY_LINE_TYPE cmock_line);
typedef void (* CMOCK_nrf_802154_priority_drop_init_CALLBACK)(int cmock_num_calls);
void nrf_802154_priority_drop_init_StubWithCallback(CMOCK_nrf_802154_priority_drop_init_CALLBACK Callback);
#define nrf_802154_priority_drop_hfclk_stop_Ignore() nrf_802154_priority_drop_hfclk_stop_CMockIgnore()
void nrf_802154_priority_drop_hfclk_stop_CMockIgnore(void);
#define nrf_802154_priority_drop_hfclk_stop_Expect() nrf_802154_priority_drop_hfclk_stop_CMockExpect(__LINE__)
void nrf_802154_priority_drop_hfclk_stop_CMockExpect(UNITY_LINE_TYPE cmock_line);
typedef void (* CMOCK_nrf_802154_priority_drop_hfclk_stop_CALLBACK)(int cmock_num_calls);
void nrf_802154_priority_drop_hfclk_stop_StubWithCallback(CMOCK_nrf_802154_priority_drop_hfclk_stop_CALLBACK Callback);
#define nrf_802154_priority_drop_hfclk_stop_terminate_Ignore() nrf_802154_priority_drop_hfclk_stop_terminate_CMockIgnore()
void nrf_802154_priority_drop_hfclk_stop_terminate_CMockIgnore(void);
#define nrf_802154_priority_drop_hfclk_stop_terminate_Expect() nrf_802154_priority_drop_hfclk_stop_terminate_CMockExpect(__LINE__)
void nrf_802154_priority_drop_hfclk_stop_terminate_CMockExpect(UNITY_LINE_TYPE cmock_line);
typedef void (* CMOCK_nrf_802154_priority_drop_hfclk_stop_terminate_CALLBACK)(int cmock_num_calls);
void nrf_802154_priority_drop_hfclk_stop_terminate_StubWithCallback(CMOCK_nrf_802154_priority_drop_hfclk_stop_terminate_CALLBACK Callback);

#endif
